4139-Allen/Door_Access_System/stm32/System/usart/usart.c
#include "sys.h"
#include "usart.h"
#include "stdarg.h"
#include "stdio.h"
#include "string.h"
#include "timer.h"
#include <stm32f10x_gpio.h>
#include <misc.h>
#include <stm32f10x_usart.h>
#include <stm32f10x_rcc.h>

//////////////////////////////////////////////////////////////////////////////////
// ������ֻ��ѧϰʹ�ã�δ���������ɣ��������������κ���;
// ALIENTEK STM32������
// ����1��ʼ��
// ����ԭ��@ALIENTEK
// ������̳:www.openedv.com
// �޸�����:2012/8/18
// �汾��V1.5
// ��Ȩ���У�����ؾ���
// Copyright(C) �������������ӿƼ����޹�˾ 2009-2019
// All rights reserved
//********************************************************************************
// V1.3�޸�˵��
// ֧����Ӧ��ͬƵ���µĴ��ڲ���������.
// �����˶�printf��֧��
// �����˴��ڽ��������.
// ������printf��һ���ַ���ʧ��bug
// V1.4�޸�˵��
// 1,�޸Ĵ��ڳ�ʼ��IO��bug
// 2,�޸���USART_RX_STA,ʹ�ô����������ֽ���Ϊ2��14�η�
// 3,������USART_REC_LEN,���ڶ��崮������������յ��ֽ���(������2��14�η�)
// 4,�޸���EN_USART1_RX��ʹ�ܷ�ʽ
// V1.5�޸�˵��
// 1,�����˶�UCOSII��֧��
//////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////
// �������´���,֧��printf����,������Ҫѡ��use MicroLIB
#if 1
#pragma import(__use_no_semihosting)
// ��׼����Ҫ��֧�ֺ���
struct __FILE
{
	int handle;
};

FILE __stdout;
// ����_sys_exit()�Ա���ʹ�ð�����ģʽ
void _sys_exit(int x)
{
	x = x;
}
// �ض���fputc����
int fputc(int ch, FILE *f)
{
	while ((USART1->SR & 0X40) == 0)
	{
	} // ѭ������,ֱ���������
	USART1->DR = (u8)ch;
	return ch;
}
#endif

// ��ʼ��IO ����1
// bound:������
void uart_init(u32 bound)
{
	// GPIO�˿�����
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE); // ʹ��USART1��GPIOAʱ��
	USART_DeInit(USART1);														  // ��λ����1
						  // USART1_TX   PA.9
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9; // PA.9
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; // �����������
	GPIO_Init(GPIOA, &GPIO_InitStructure);			// ��ʼ��PA9

	// USART1_RX	  PA.10
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure); // ��ʼ��PA10

	// Usart1 NVIC ����

	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3; // ��ռ���ȼ�3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;		  // �����ȼ�3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			  // IRQͨ��ʹ��
	NVIC_Init(&NVIC_InitStructure);							  // ����ָ���Ĳ�����ʼ��VIC�Ĵ���

	// USART ��ʼ������

	USART_InitStructure.USART_BaudRate = bound;										// һ������Ϊ9600;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						// �ֳ�Ϊ8λ���ݸ�ʽ
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							// һ��ֹͣλ
	USART_InitStructure.USART_Parity = USART_Parity_No;								// ����żУ��λ
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // ��Ӳ������������
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					// �շ�ģʽ

	USART_Init(USART1, &USART_InitStructure);	   // ��ʼ������
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE); // �����ж�
	USART_ITConfig(USART1, USART_IT_IDLE, ENABLE); // �����ж�
	USART_Cmd(USART1, ENABLE);					   // ʹ�ܴ���
}

uint8_t rx_cnt = 0;
uint8_t rx_buf[rx1_buf_size];
uint8_t rx_finish_flag = 0;
void USART1_IRQHandler(void) // ����1�жϷ������
{
	u8 Res;
	uint8_t clear = 0;
	if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)
	{
		Res = USART_ReceiveData(USART1);
		if (rx_cnt < rx1_buf_size)
		{
			rx_buf[rx_cnt++] = Res;
		}
	}
	if (USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)
	{
		clear = USART1->SR;
		clear = USART1->DR;
		rx_finish_flag = 1;
		// 不再清 rx_cnt，主循环通过 rx_finish_flag 处理完再清
	}
}

// ���ڽ��ջ�����
u8 USART2_RX_BUF[USART2_MAX_RECV_LEN]; // ���ջ���,���USART2_MAX_RECV_LEN���ֽ�.
u8 USART2_TX_BUF[USART2_MAX_SEND_LEN]; // ���ͻ���,���USART2_MAX_SEND_LEN�ֽ�

// ͨ���жϽ�������2���ַ�֮���ʱ������10ms�������ǲ���һ������������.
// ���2���ַ����ռ������10ms,����Ϊ����1����������.Ҳ���ǳ���10msû�н��յ�
// �κ�����,���ʾ�˴ν������.
// ���յ�������״̬
//[15]:0,û�н��յ�����;1,���յ���һ������.
//[14:0]:���յ������ݳ���
vu16 USART2_RX_STA = 0;

void USART2_IRQHandler(void)
{
	u8 res;
	if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET) // ���յ�����
	{
		res = USART_ReceiveData(USART2);
		if ((USART2_RX_STA & (1 << 15)) == 0) // �������һ������,��û�б�����,���ٽ�����������
		{
			if (USART2_RX_STA < USART2_MAX_RECV_LEN) // �����Խ�������
			{
				TIM_SetCounter(TIM3, 0); // ���������          				//���������
				if (USART2_RX_STA == 0)	 // ʹ�ܶ�ʱ��3���ж�
				{
					TIM_Cmd(TIM3, ENABLE); // ʹ�ܶ�ʱ��3
				}
				USART2_RX_BUF[USART2_RX_STA++] = res; // ��¼���յ���ֵ
			}
			else
			{
				USART2_RX_STA |= 1 << 15; // ǿ�Ʊ�ǽ������
			}
		}
	}
}

// ��ʼ��IO ����2
// pclk1:PCLK1ʱ��Ƶ��(Mhz)
// bound:������
void uart2_init(u32 bound)
{

	NVIC_InitTypeDef NVIC_InitStructure;
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);  // GPIOAʱ��
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE); // ����2ʱ��ʹ��

	USART_DeInit(USART2); // ��λ����2
						  // USART2_TX   PA2
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2; // PA2
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; // �����������
	GPIO_Init(GPIOA, &GPIO_InitStructure);			// ��ʼ��PA2

	// USART2_RX	  PA3
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; // ��������
	GPIO_Init(GPIOA, &GPIO_InitStructure);				  // ��ʼ��PA3

	USART_InitStructure.USART_BaudRate = bound;										// ����������
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;						// �ֳ�Ϊ8λ���ݸ�ʽ
	USART_InitStructure.USART_StopBits = USART_StopBits_1;							// һ��ֹͣλ
	USART_InitStructure.USART_Parity = USART_Parity_No;								// ����żУ��λ
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; // ��Ӳ������������
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;					// �շ�ģʽ

	USART_Init(USART2, &USART_InitStructure); // ��ʼ������2

	USART_Cmd(USART2, ENABLE); // ʹ�ܴ���

	// ʹ�ܽ����ж�
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE); // �����ж�

	// �����ж����ȼ�
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2; // ��ռ���ȼ�3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;		  // �����ȼ�3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			  // IRQͨ��ʹ��
	NVIC_Init(&NVIC_InitStructure);							  // ����ָ���Ĳ�����ʼ��VIC�Ĵ���

	Timer3_Init(99, 7199);	// 10ms�ж�
	USART2_RX_STA = 0;		// ����
	TIM_Cmd(TIM3, DISABLE); // �رն�ʱ��3
}

// ����2,printf ����
// ȷ��һ�η������ݲ�����USART3_MAX_SEND_LEN�ֽ�
void u2_printf(char *fmt, ...)
{
	u16 i, j;
	va_list ap;
	va_start(ap, fmt);
	vsprintf((char *)USART2_TX_BUF, fmt, ap);
	va_end(ap);
	i = strlen((const char *)USART2_TX_BUF); // �˴η������ݵĳ���
	for (j = 0; j < i; j++)					 // ѭ����������
	{
		while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
			; // ѭ������,ֱ���������
		USART_SendData(USART2, USART2_TX_BUF[j]);
	}
}
